{
    "2024-02-03": [
        "Infanticide. I'm with hatice, we are travelling and seeing family. We are deciding to break up. We are in a bedroom, just the two of us. For some reason I give her my electronic weed pen in the breakup. A bit later I decide that I want it back. I go and ask her for the pen I gave her earlier. I don't want to be obvious because she is talking to a father figure. The father figure is quite interested in why I keep asking her about a pen. She doesn't seem to know what I am talking about. Finally she realizes and she throws the pen in a fire. The father figure realizes and gets very angry. The father starts to turn into a fiery devil. I run to the bathroom to escape him. It is pitch black in the small bathroom. I don't know why, but the devil begins chanting infanticide over and over.",
        "Family Boating. I am on a small vacation with family. We are on a boat at a boat dock. The young neices are there on the boat dock. One little girl falls in the water and I help her out. Uncle Alan shows up, I feel bad about Logan dying and I hold his hand. It is awkward, we switch to holding pinky fingers."
    ],
    "2024-01-31": [
        "Lent Gel Pens. I am in some place with some other people that i am not especially close to. There are kids there. I have two nice gel pens that i really like. I got the gel pens for free. But they are expensive. There are some kids there. I let the kids use my nice gel pens. They press too hard and mess up the tips of the gel pens. The gel pen tips get flattened. I try the pens out some to see how messed up they are. I am disappointed, but it isn't too bad because I know I can get more."
    ],
    "2024-01-23": [
        "Colorful Alien Expedition. I'm on a mission to a foreign alien planet with a few other astronauts. At first we only see alien plants, then we start to notice colorful explosions like neon oil slicks in the distant sky. We continue travelling across the planet and we find something like a massive mushroom that has a head that could be thousands of meters high. The incredibly enormous alien mushroom is dropping colorful spores on us from the distant atmosphere. We find a green alien vine animal-plant hybrid. The alien sentient plant attacks me be shooting long vines out from itself. Massive chunks of colorful alien spores with powder coming out of them continue to fall from the sky. They explode on the ground. A friend releases the alien cine plant-animal green alien hybrid from its hold on me. My limbs are wrapped on alien vine arms."
    ],
    "2024-01-19": [
        "Roommate Drugging. A group of us have an apartment together. One girl tries to drug the rest of us, but for some reason it doesn't work on me. The mean girl threatens me by saying that if I won't take the drug then everyone will assume that it was me that drugged everyone.",
        "Whoopa Money. I needed money for some reason, so I emailed Whoopa(grandpa). Shortly after sending the email to him, I regretted it. I started looking into ways to get rid of it. I thought maybe I could get into his email and delete it. Then I thought maybe I could tell him that it was a scammer."
    ],
    "2024-01-18": [
        "Siri Airbnb. There are a few of us staying at an airbnb. Siri is there, he had his own room in the back of the house. His room has a shower too. With no tub. I remember seeing a towel on his shower floor that is either stained yellow or burnt. There is a very competitive vibe, like everyone at the house is in a battle.",
        "Snowy Steps. There are a few of us going down some snowy and slippery wooden steps. The snowy steps are outside and going down a hill, maybe to a lake or a lake lookout. There is a worker there telling people to go down carefully."
    ],
    "2024-01-17": [
        "Magic Dad on A Boat. I'm on a massive boat, there are a good number of people around. Nick or Ben or someone is on the boat as well. We have a father with powers or something and he is being hunted. The boat docks and nearly everyone gets off. I think I may have been sleeping, so I stayed on the massive cruise ship. My dad with magic powers either stays on or teleports back on the ship to me. Somehow I show up in an American neighborhood somewhere that is full of turkish people. As soon as I get there, a group of tiny fierce dogs approach me on the sidewalk. They are some sort of mix between chiwawa and Rottweiler. They are small. But mean looking, they bite at my pants leg, but I'm not afraid of them. I pick one of them up, but then put it down a little bit later. I keep walking through the little turkish neighborhood. I get to a small outside train station. People are there, and I hear one kid ask another how old they are."
    ],
    "2024-01-16": [
        "Computer Teacher Bus Driver. I'm in a foreign country. I find out about a casino and I go. After I play for a day or two I decide to go somewhere new. I board a bus and and sitting when I realize my bus driver is my computer teacher from highschool. He has 2 friends with him as well. We talk for awhile about my future and why I'm studying. In the next dream the same computer teacher has a classroom. I go visit him at the classroom and he gives me a book. He is watching a clip from spys in the sea, the discovery show about robot animals in the ocean. I give him information on the show. I leave and am getting on a bus with Hatice. The bus is 3 stories tall. When I board the bus I am made to go up while Hatice stays down for some reason. The bus is pretty cramped and I am annoyed that they workers didn't let Hatice come up and sit with me."
    ],
    "2024-01-15": [
        "Highschool Fastfood Job. I'm in highschool, I get a job fast-food place. It starts at 2pm. That's the same time school ends. The fast-food restaurant is just across the street from the school. The boss at the fast-food restaurant seems pretty intimidating. I'm at my last class of the day at school and a student says they have to go because it is 2pm. I didn't realize it was so late, I'm disappointed. I have to put on my fast-food work shirt. I hurry over to work, but get there late. I decide I will ask for later start times. I have some thought about starting later meaning that I will have to stay very late."
    ],
    "2024-01-14": [
        "Thailand Vacation Escape. Hatice and I are on vacation in Thailand. We discuss for a long time where to actually go in Thailand. We decide to be on the mainland first, then we will go to an island. We talk about getting a moped. I ask if Hatice can drive it without a license. We think Hatice can drive the moped. We make a friend that is a local to Thailand. One day he finds out that bad people are coming to get us. He tells us we have to leave immediately. We start packing up all of our stuff. We are packing so fast and messy. Things are not going nicely into our bags because we are rushing. The friend is getting nervous. We decide to leave before everything is packed and we say we will just hide the rest and come back for it."
    ],
    "2024-01-13": [
        "Joe Meetup. I stayed near a beach somewhere in a house. I get a message from Joe, he wants to come visit. It will be a bit of a drive for him. He sends his Google location. When I look at Google maps I notice his pin is always on top of 2 moving cars. So I know he got a ride from someone. He says he is going to cheese cake factory. I try to contact him and tell him my location but I can't get through. I have a drone, so I fly out and find their car. I see them park in the parking lot. The other guy has short hair and a white tank top. I arrive in person a little bot later with some friends. We are seated in the restaurant and then I go to find Joe. Joe and some friends are seated elsewhere. I pretend to do a magic trick where I describe the driver of the car Joe arrived in. We tell the very tall waiter that both of our groups want to sit together, bit the waiter says no. We are annoyed and so we all decide to leave without tipping. I felt a little bad, but I'm annoyed because we could have moved tables and sat together."
    ],
    "2024-01-12": [
        "Living Room Family Juggling Show. I'm with Hatice and her extended family. We are at the Driftwood Dr. House. I am asked, and pretty much told that i will do a juggling show for the kids. I cut my hand pretty bad. The back of my hand has a long cut on it from my wrist to my middle finger. I don't want to do the show. But word has spread and people are expecting it. I try to prepare ideas in my head. I decide to go with a food theme juggling show for the kids in the living room. I decide to start with balancing a straw with an olive on it on my nose. I'm not sure if there is no olives or what, so I improvise and I make a craft sculpture using scissors and the straw. At the beginning of the show a mother says she will leave to get vegan food and asks if I want any. I use one of the boys as my assistant. I ask him to find some tape for me. I realize there is already tape next to me so I tell him to throw imaginary tape to me instead of real tape so I can make it magically appear. I don't know why, but the little boy starts crying. The crying boy in the living room juggling show that i am performing makes me feel uncomfortable."
    ],
    "2024-01-11": [
        "Meh Juggling Show. I'm at a stage show that seems fairly professional. A group od performers that look like misfit ragamuffin go up on stage. It turns out they are jugglers, and I'm encouraged to go up. One of them starts juggling and they are not great, and they drop on their last throw. Everyone starts juggling on stage randomly, nobody is great. I try juggling 5 black and white balls,but I'm so out of practice. I drop the juggling balls a lot. Finally our time ends and we all get off stage. I go to a fancy restaurant with friends afterwards. The menu is edible, it gives a taste of what the things that can be ordered is. We are still looking at the menu when the restaurant closes. The waiter takes some of the menu, but I am able to keep some of it too."
    ],
    "2024-01-10": [
        "Icecapades. I'm on vacation with an Asian girlfriend. It isn't winter, but there is a mountain nearby with skiing. I go to the skiing place alone. It is steep, and the ski slope is very much just one specific route down the mountain. I go down the specific ski track down the mountain. I go up a ski ramp and do a back flip. After skiing I go back to the place my Asian girlfriend is waiting. We go to a party together. There are not many people there. The people are having an orgy at the party. I don't know if me and my girlfriend are involved in the orgy. My Asian girlfriend and I go walk through town to go back to the place we are staying. We see a cute homeless girl. We ask the cute homeless girl if she wants to come home with us. We sexually dominate the cute homeless girl. We tie the cute homeless girl up and mercilessly sexual tease her."
    ],
    "2024-01-07": [
        "Table Crayon Drawing. I am sat at the end of a table with hatice and Chelsea. The table we are sitting at is like a booth table. We are talking at the end of the table. Some other people start showing up. I think it is Chuck and his family. Maybe the other girl is Audrey, not Chelsea. The people who show up bring a piece of paper. I think the paper is a black and white flyer. They bring crayons with the paper. I start drawing blue on the paper. Then I draw green crayon under the blue. I add some brown crayon mountains to the green and blue crayon. Other people join in and start adding more colors to it. The crayon drawing starts to look kind of nice, almost like a painting."
    ],
    "2024-01-06": [
        "Family Reunion Cards. I'm at some sort of reunion. Sometimes it seems like nick and the kids, but sometimes it is different people. We are hanging out inside a house. I give presents to some of the kids. It gets to be time to sleep. There is a separate basement like at Chelsea's house. I want to go down there to sleep. I go down with a girl that is probably hatice. A weird guy comes down too, he hangs out for a while and we tell him we will sleep and he has to leave. He is disappointed by this and hangs out by the glass sliding doors after we lock them. Later Nick and Kaius will play magic, the card game. They show me special new cards that are animated by absorbing light on their back side. This reminds me of the playing cards I got kaius that I got kaius. They are playing cards that are stereograms."
    ],
    "2024-01-05": [
        "Speed Couples Retreat. I am at a retreat with a bunch of guys and girls about my age. It is a sort of speed dating retreat, but for 24 hour relationships. The host of the dating retreat is an old lady. On the first day we all draw names from a bucket. As more and more people get paired together I start to be concerned that I will end up with another guy. I don't know if it is possible for for guys to be paired with guys. In the end I get paired with Rachel. The only thing I remember us doing is sleeping together."
    ],
    "2024-01-04": [
        "Juggling Meetup Beanbag Search. I was at some place juggling. There were other jugglers there. There are lots of juggling beanbags on the ground. An old man is going around gathering up his beanbags. He seems to be unsure of which are his. I help him compare beanbags to figure out which are his."
    ],
    "2024-01-03": [
        "Band Without Dropping Juggler. I see a band I really like in a small venue. There is a song that is especially good and I want to hear it again. The song is about lesbians. I am able to find the band again in the same part of town a few days later. I tell the tall lead singer I like the song and want to hear it again. He tells me the name of it and I write it on a plastic wrapper. The ink isn't staying on the plastic so i write it on a napkin. He also tells me the address of their next show and I write that down too. I show up at the venue early when they are practicing. I mention I juggle with musicians. He says I cant juggle while they perform because I may drop. I do a few throws of a juggling pattern and drop right away. We talk for a long time about my different kind of LED juggling balls. I have lots of different kinds of juggling balls, some are pretty irregular. A couple have small things that move around on the outside of them and they seem annoying to juggle. I pull up some software I have made for handling color changes. My software has a timeline layout, but the software is not finished.",
        "Convicts Ceramic Sword Situation. Two prisoners have a brown paper bag. Inside the brown paper bag are two precious ceramic swords. Other prisoners break the ceramic swords in the brown paper bag. The prisoners swear vengeance. Months later, the guys who broke the ceramic swords are in a prison sword fighting class. Someone shows up and offers to spar with one of them. They agree and they begin to duel. At first they are fighting with fake swords. The stranger switches the fake swords with real ones with a magnificent flair. They expertly kill them during the knife fight. The old lady sword fighting teacher is annoyed that the swords got switched out for real ones. The murderer flees the sword fighting class. The murderer prisoner escapes off a balcony."
    ],
    "2024-01-02": [
        "Convenience store poker game. There is a short chubby foreign man working at his own convenience store. He has playing cards near the cash register on the counter. he has a deal where the customer pays for 2 cards and tries to get best hands with 5 card flop. You can pay more to get 2 more cards and a 2 more cards to make a 7 card flop. I go to do this up to a 9 card flop and he stops me and says this is just a training game, not something to be played all the time. He says people can play it once every 5 days.",
        "Post apocalypse world. Most people are dead. I'm on the run from bad guys, but I have some time. The bad guys are coming in a car on a dirt road. I move stuff in the way of the road. I am very strong, I'm able to move an old car into the road with my bare hands. In another place there is heavy machinery and a gang that has control of it."
    ],
    "2023-12-28": [
        "Ocean Circus Stage. Hatice and I are in Hawaii. We are at different places, but plan to meet up. She calls and tells me that she is going to do something with someone this evening. I am wondering around Hawaii jealous. I visit my tent in the Hawaii rainforest. Hatice tells me on the phone that she wants to meet up with me after she is done hanging out with some guy she meant. I don't want to meet up. I go to a beach and there are people there setting up for an event in the ocean. There is a stage in the water. There are about a dozen people in water around the floating stage as it is being set up. I get in the Hawaiin ocean water and join the crowd and i talk to a lady on the stage. She recognizes me and asks if I have ever been on the live version of Matt Walsh's improv for humans. I say I have long ago. She asks if I am still staying at nicks house on the island. I tell her nick and I both used to stay at Jason's house on the island. I say that this time I am moving around, sometimes I stay in my tent in the woods and sometimes at Jason's place. She says the show will start at 10:00pm tonight. I get out of the water and go talk to a guy about the show. It is a circus talent show competition. I have the idea to juggling glowing LED balls in the water. I ask if anyone juggles glowing LED balls for the ocean stage show. He says about 6 people usually do. I ask if people have waterproof LED juggling balls for this. My idea is to use my glowing LED juggling balls with bags over them. I remember the balls that you turn on and off with magnets. I tell him about them, there are no holes for water to get into and they are wireless charging. We keep talking, he tells me that there is basically 2 different groups that the performers come from. One group is led by a guy with a small psychedelic tent where people smoke weed and do mushrooms."
    ],
    "2023-12-25": [
        "Mr. Beast Park. I'm in a woods park with a small group of people ans Mr. Beast(the youtube star). Some people gather kindling for a fire. We start to build the fire. The fire starts to grow in our campfire. We build a small table out of forest sticks on the fire. The fire is only on top the campfire kindling table we built. I put my head under it to try to build a new fire underneath. I leave with Mr. Beast and his wife and young child. We get on small circle rafts in the ocean. He has bet someone that he could stay on the raft for days with just a few forgiveness. We ride out small circle rafts over massive stingrays in the ocean. We ride out small circle rafts over massive eels in the ocean. Mr. Beast falls odf his raft. I think he made a terrible bet, there is no way he can do this. I keep trying to clarify the rules of the bet because I think there's something I'm not understanding. In the end, he admits he made a bad bet."
    ],
    "2023-12-23": [
        "Yarn Lady Apartment. I got an apartment north of town. It felt like an abandoned apartment. It was very rundown. There is a couple living in another room in the same apartment. I am going home my first night and there is a lady there. The lady is made out of yarn. I talk to her by the front door. I go back to town to get something. I go back to the abandoned apartment. My roommates are there. I ask them in the abandoned apartment about the yarn lady. They know nothing about her. We start playing basketball in the living room of the abandoned apartment. The basketball hoop starts acting weird. Some impossible face appears in the basketball hoop. W freak out and leave the apartment. I forget my bag there and want to go back. They say I shouldn't."
    ],
    "2023-12-21": [
        "Cat Center. I'm with a friend at a cat place. It is like a cat safları, or a cat zoo. There are lots of cats, but sometimes they are hiding. We come across an indoor cat store. It is all about cats. The owner is there are we talk to him briefly. There are real time cat sounds being played over wall speakers in the store. There are microphones outside listening to cats. I mention that it would be cool if they made a vr cat suit that people could wear in a special room in the cat shop. Then have it hooked up to a cat robot outside where all the cats are. Then people could interact with cats as if they themself were a cat."
    ],
    "2023-12-18": [
        "Laptop Gone. I'm staying at nicks house, but it is different. Lots of the family is there, mom, dad, nick, Ben, me. We all go out one night, when we come home somebody notices the door was broken when we got home. Not much seems to be taken, some laptops are still there. I go upstairs. My laptop is missing. I regret not having my security camera program on. I try not to feel too bad about being gone."
    ],
    "2023-12-15": [
        "Nap Game. This was just a daytime nap. I know the dream was longer, but I forgot it. There was a game where the player comes into a room and then has to decide if they will cuddle with whoever is laying naked under a blanket. There was an old lady naked under the blanket. Because of this I lost the game. Then I watched from the other room as the next player came in to play."
    ],
    "2023-12-14": [
        "Green Convenience Store Bag. I was poor in a city. I went to a convenience store with a green bag and they gave me lots of coins. It was about 20 dollars worth."
    ],
    "2023-12-09": [
        "Bike Highway. I'm about high-school age. I'm biking in the middle of the highway with a girl. My bike is fast. It is dangerous to be biking here. I ride way ahead of the girl on her bike.",
        "McDonalds Line. There is a group of us on a bus. We all stop to get in line to get McDonalds. I decide I will get vegan nuggets. I start talking to a guy and they have a coupon. They say we can both use it. I write down that we want a nugget meal, one vegan and one regular. The coupon is a long narrow strip of paper. The guy covers the coupon in ketchup and mustard. He tells me not to let any vegans get ahold of the coupon. I tell him I am vegan. The McDonalds workers at the counter are very nice."
    ],
    "2023-12-08": [
        "Prison Horror Movie. I'm watching a movie with some friends. It is a horror prison movie. At the beginning, one inmate agrees to play tug-of-war with another inmate. They cheat and the other guy falls into a deep dark pit. That player gets taken away to a hospital or something. Now the suspense begins. We know that inmate will come back for revenge. Eventually they do come back. One inmate reaches through some bars and grabs the other inmates legs."
    ],
    "2023-12-07": [
        "Secret Asian Food Deliviery. I am delivering food in a big city like NYC. I get a delivery to an apartment building to a cute Asian girl. We start talking in her kitchen. I am impressing her in her kitchen with my little bit of Japanese. She starts teaching me a little bit of Japanese in her kitchen. I dance with the Asian girl in her kitchen. The Asian girl and i make out in her kitchen. I feel bad for cheating. We exchange numbers and make plans to meet up again. I got back to her apartment building to have dinner with her and a couple friends. Me and two girls are crammed into a tiny elevator. We can not even stand all the way up because the ceiling in the elevator is so low. It is very dark in the cramped elevator for the three of us. There is something strange like a green color theme on a computer. I am wearing green and it matches the Asian girls green apartment. I tell the other girls that I am kind of dating the Asian girl, but it is a secret."
    ],
    "2023-12-06": [
        "Spanish Hardware. I'm Hanging out with nick and Ben and Daulton. I mention to Ben that Spain is one of the best countries ever. Next thing I know I am in Spain with nick and Ben. Ben is loving Spain. We go to a casino. I give Ben some poker advice. He seems serious about following the advice because he wants a way to make money so he can stay in spain. I have a special player's card. We leave the casino and go outside of the casino. There is an outdoor nightclub on a grassy area, it looks cool, but is empty. We watch a video on someone's phone. In the video on someone's phone, somebody is showing how tall their building is be showing their view make s a huge tower look tiny. We leave the casino area and start walking through town. As we are walking through the city we see a little girl yelling for her mother. We continue walking through town. We get to a hardware store. I remember being at this hardware store before. I am barefoot in the parking lot of the hardware store. There are small square sheets of plastic lined on the ground for use to step on. Someone is taking pictures as we walk down them. My barefoot are sticking to the small square pieces of paper. I ask if I should put my shoes on. A lady says I should and I should disinfect my feet first. I say I will was them too. There is a bench next to a hose and an open loading area in the back of the parking lot. The water run down a slight sloping the parking lot to a drain on the ground."
    ],
    "2023-12-05": [
        "Carnival Destruction. I'm with mom and dad in a front yard. An acquaintance carnival owner comes over. They have a huge truck loaded with massive carnival equipment. They construct a huge tower ride where a couple people sit in a capsule and freefall and almost hit the ground. The free falling carnival ride capsule serves at the last instant to avoid the ground. Me and mom do the free fall carnival capsule rude together. The carnival guy and dad leaves. Mom wants to move the tower ride a little bit. When we do, it falls. The massive tower crushes the man's large truck. We are standing the yard looking at the massive tower ride that crushed the large truck. I ask mom if she wants to lie about it and she says no. When the carnival man comes back and sees it, he is very sad. He says something that makes it seem like he forged an insurance signature or something. When I ask if he forged something, he says no. At the very end mom is quite sad. She says that up until it fell she thought this whole experience had changed her life for the better."
    ],
    "2023-12-04": [
        "Nicks Aquarium. I am at nicks house. We are looking at his aquarium. His coral has gotten big and has flowers growing from it. I start explaining about the aquarium  and what's happening with authority, but I doubt myself at first. After a little while I remember about coral spawning and I explain that. Male and female both send out egg and sperm at the same time. They meet up quickly,  but they need to get away from the coral so they drift out to sea. Eventually they are almost ready to root so they start listening for their parent reef and they had back to get ready to root."
    ],
    "2023-12-03": [
        "Family Razors. I'm with the family at the ranch house. We are all hanging out, getting ready to go on a trip. We are packing. I plug in my yellow and black electric razor. Dad has the same razor, but he doesn't have the charger so he thinks he can't use it. I check and find out that any usb-c cord will work."
    ],
    "2023-12-01": [
        "Coffeeshop Tech Meetup. I'm in a very nice, new modern, tech focused city. There is going to be some sort of tech presentation happening at a coffeeshop later. I go over there early and hang out. There are two floors, an upstairs and downstairs. I sit at a table upstairs. I leave and go to another coffeeshop to pass some time before it starts. I'm on my computer at a table at the other coffee shop. A girl asks me if the other one has lots of seating, I say that it does. I lose track of time, and then have to rush to gather my stuff. The coffeeshop has put lots of flyers on the table for me to take."
    ],
    "2023-11-29": [
        "Boom Mic Crowds. I'm in a 2nd world country. There are lots of crowds in the street. Many people have large boom mics being held over certain crowds, it is to be able to hear certain conversations. I leave my orange and black netted bag on a city bench. I talk to someone in the bustling bohemian city street. I get back to the bench and my bag is gone, there is a teenage sitting on the bench. I notice someone else with a bag like mine when I'm looking for mine. The teenager shows me that he put my orange and black bag under the bench. I go to a rental apartment with Hatice. There is a very plain kitchen. The fridge is to the left of a cupboard. The cupboard is empty except for some cans of beans. Hatice wants to leave, she is annoyed that I'm being slow. I'm making sure everything is turned off and locked. There is a round silver lock on the front door. Hatice is waiting in the car while I try to use the silver apartment door lock."
    ],
    "2023-11-28": [
        "Blue Shirt Show. I'm wearing a blue shirt and am on a college campus for a special event. I am wearing a blue shirt on stage, there are lots of people wearing all white on stage with me. I wonder around on stage in a blue shirt amongst other people wearing white. Gradually they all leave the stage until just I am left. I go walk around outside around the campus, I'm wearing a blue shirt."
    ],
    "2023-11-27": [
        "Public Toilet. I am sitting on a toilet in a room with a few other people. It is an awkward situation, i am embarrassed. There is no toilet paper. I have to wipe my ass with my bare hand. There is a sink next to the toilet.",
        "Pencil Plane. I'm on small commercial plane. I see a sky view of the plane landing on a small, long Island that is pretty much just a runway surrounded by water. I have lots of bundles of pencils around my airplane seat stuffed in weird places. While sitting in my airplane seat I pee into a bundle of pencils the plane lands on the long and narrow runway island."
    ],
    "2023-11-26": [
        "Gym Room Dressing. I am at a fancy high-class gym changing room. I am preparing for a date there. After I finish preparing for my date, I go to the woman's changing room. Chelsea is helping Hatice prepare for the date. Chelsea is doing Hatice's hair. Hatice leaves to go get dressed. I am talking to Chelsea in the fancy woman's gym changing room. Hatice comes back and she is wearing a beautiful yellow dress. I am complimenting Hatice about it in the woman's gym changing room."
    ],
    "2023-11-25": [
        "Avocado War. I'm in an Army that is going through and destroying enemy territory. I am  eating food left by the enemy army. We get to a place that has lots of avocados. There are locals from the land there but we don't kill them, we are only after soldiers.",
        "Pirate Grandma. I am somewhere and I know mom is there with grandma. They know I am sort of around, but didn't know I was right at the same place as them. I watch them from a distance. Mom sees me. I ask how they are. She says not good. Grandma had pirated music and her music player is refusing to give her the music back now. It is like a public use boombox. I say that I think I can get it back, but it may be tough. I think we can get a print screen of all her music and then male an AI that torrents it all. Before I do that i see a girl my age that works here and has special abilities. She says that she can make a new player as well as free all her music from being ruined.",
        "Performative Pooping and Pizza. I go to a movie theater, I'm early, but there is a coffee shop. I have my own private coffee shop room with just a single table. There is a toilet behind a divider wall in the private coffee shop room. After awhile I go to use the toilet to poop. As soon as I'm about to poop, someone comes to use the bathroom. They look through the window on the door and see me about to poop. They leave and come right back and look at me again through the window. It is awkward. After I'm done at the coffee shop, I go to a show that uncle Allen is doing on a stage. I go up on stage as his volunteer. He has me hold a circle tray on the stage. He throws some food onto the tray I am holding. Then he throws a pizza onto the tray I am holding. The pizza is a puppet he has control of from across the stage. I see the pizza hanging from strings. He does a comedy routine where the pizza is almost sliding off of the tray. The pizza is dancing on the tray I am holding."
    ],
    "2023-11-24": [
        "Hooker Hotel. I get a hotel in a foreign land. It is a room at a brothel. After I arrive, I immediately leave and I go to a massage place. It is a cheap massage place, everyone is in the same large room getting massages. The masseuses are giving handjobs and blowjobs. I leave the building. I buy a snack. I go sit in park to eat the snack. Finally I go back to my brothel hotel. I start talking to the worker at the brothel. They introduce me to girl and guy prostitutes and are expecting me to choose. I hang out in the brothel lobby for a long time trying to decide if I will sleep with one. I'm hanging out for a very long time with the prostitutes. Finally, I leave and go downstairs to my small hotel room in the brothel. The layout of the hotel is strange, there is a prostitute in my apartment with her own room."
    ],
    "2023-11-23": [
        "Poll Coat Rack. I'm playing pool with Dan and Ben. It gets down to the last few balls, I go to take my shot and the back of my stick is hitting a coat rack. I move the coat rack, but it is still hitting it. I have to move it a few times before I can get a good shot. Finally I take my shot and I scratch."
    ],
    "2023-11-21": [
        "Upper Garage Door. I'm at the Bird Drive house with dad. We bought it again. There is a garage door on the top floor of the house, it is over the back yard. The garage door is stuck and won't open. We want to come up with a way to open it. We have a small crane. Dad thinks we can get the crane all the way upstairs. I think we should use a pulley system to get the door unstuck.",
        "Food Line. I am somewhere with lots of kids lined up to get food. After them, adults line up for food. I get in line early, but then realize it isn't vegan. I am covered in a black body paint latex, even my mouth is covered"
    ],
    "2023-11-20": [
        "Conference Encounter I am at a conference. I stay late until there are just three of us left, me, a woman my age, and the elderly woman presenter. We go to a really nice large house. We all three sleep on the same bed. We begin to have a really awkward threesome. I feel like only the elderly woman actually enjoys it.",
        "Cathode. It is really vague, but it's about electrodes and cathode and anodes."
    ],
    "2023-11-19": [
        "Game Mouse Park. I'm at a place where parents drop off their kids and we watch them. It is very free, outdoors, big grass area with ponds and bridges. Some kids hang out on their own or in groups. There are a group of us that go off to play a board game(Secret Hitler). After awhile I leave the game to walk around some. There are lots of rats free to roam here, they are like pets. I walk around watching rat moms with their kids. I see one mom with her kid and she has a different rat in her mouth that I think she is trying to eat. It get free from her and I pick it up and throw it at a rock. I don't know why, I guess I wanted to help her be able to eat it. I immediately feel guilty and hope nobody saw what I did. I notice one of the boys we were playing the board game with. His brother is around too. His dad is walking toward us. I try to gesture to the kid to see if he wants to play more board game(Secret Hitler). His dad is coming back from disliking and is quite dirty. His dad says they are going home now."
    ],
    "2023-11-18": [
        "Son Art. There's a mother who comes home after a long time. A son who has made pictures at some sort of communal museum. The pictures are spins on or remakes of popular cartoons, the pictures require batteries, maybe for lights. There is a kid in the neighborhood who has repeatedly taking batteries from the family without asking. A bow and arrow battle ensues between the mom and son and the thief. The mom and son wins. Then explains kindly why he can't be stealing all of their batteries."
    ],
    "2023-11-17": [
        "3D Tanning Printer. Hanging out with nick, dad, a couple other people. Some sitting on bed, some standing, someone building something on the floor. We are talking about light 3d printer machines. I mention a tanning bed 3D printer could be made to give a tan image."
    ],
    "2023-11-16": [
        "Spinning Lighthouse. I am in an old leaning lighthouse with a glass floor. It seems very unsafe, but it is a tourist attraction. There are more people in here, and I can see many more climbing a latter up to get in. I am in the front, more people are coming over here to see. I'm freaked out a bit, I don't know how this is legal. As I work my way to the middle it starts to spin, I'm feeling sick, I close me eyes, I go to the back side and put my head down. Beverly calls. She is pregnant, I congratulate her."
    ],
    "2023-11-15": [
        "Train Worker. I get a job working for a train/metro company. I get in the train one day to go work. I have a jacket on and im carrying another one. The train is for train workers only. A couple with a small child gets on and I get up for them. I almost miss my stop, nyc, so I hurry off the train. I forgot my jackets! The lady notices and holds them up, but it's too late, the doors are closed and the train starts moving. I start looking for a worker. As I'm looking, a small child falls from above onto some tracks, they seem ok, some people start helping the child. I get on a train going north to the next and last stop. It is a prison."
    ],
    "2023-11-13": [
        "Mud Pit Podcast. I'm hanging out in a city kind of like I'm homeless, but I'm not really. I have some place to stay. I do however find a large hard to get to muddy pond that is locked up behind a wall in a courtyard kinda place. There is electricity and a radio there. I drain the pond and dig it all out very deep and refill it to have a deeper pond. Later on I go back to it and listen to a comedian podcast while I run more water into it. It gets late and I leave to go home. I realize after I go that I forgot to turn off the water and the radio. When I try to go back I keep missing my entrance door, I guess I'm distracted. Finally I'm getting in and I come across a guy who kind of seems to be in charge of homeless community, he asks a couple people if they are living in the courtyard, they say no. He asks me and I say no, but I was just listening to a podcast in there and i was gonna turn it off. He says OK."
    ],
    "2023-11-12": [
        "Multi-floor Card Game. I'm at a place with many floors and elevators and escalator and there are tons of us playing a game. A very official game with referees. I almost feel like we have to play. Like we are in school or jail. The rules just seem to be that in order to leave this place you need to match all your cards, maybe just by color. The game tells everyone where there are cards remaining, but if you run out of the ability to win then you are out of the game. For some reason I have gotten too relaxed by the end of the game. I needed this last card and I wasn't even on my way to it. When I realized I started sprinting. I pass a player on the steps on the way, then I see the top of the steps. There is a woman almost all the way there, a very fat lady. I go up the steps as fast as I can. I kind of pull on her. Then I let go and apologize. She gets the last card, but she can't use it. I get it. I can use it because I have a wild card. Now I have a red and a wild and a few brown cards. There is a final brown cards/s in an elevator, I'll get more cards if I get the other brown.",
        "Ryan Hangout. Hatice and I move to a new city. We make some friends through a group of people, the guy is a ryan gosling. He is dating a beautiful woman. The 4 of us hang out for awhile in their apartment. It is kind of boring, hatice leaves and I say I'll be home soon. After she leaves ryan starts doing one armed pull-ups, he is very strong. I joke about them not being very good and we start to wrestle. I am mostly winning. I mention it and he just stands up and easily breaks out of my holds. I am humbled. He leaves and I lay on the couch. I'm kind of sleepy. His gf comes over and puts a sheet on me and holds my wrist. She says she loves me. I am super uncomfortable. I tell her she doesn't, that we barely know each other, we've only met twice. She holds my hand and I pull away. I go home, hatice is there with friends, I have a bag of adult supplies that I got from the couples house. I show them, we laugh. Hatice and I know we will use them."
    ],
    "2023-11-10": [
        "Future Self Sacrifice. Some kind of future world. I'm with an acquatence. Another one shows up and we are going to go somewhere. The second one is supposed to inflict the first one with deadly poison because they broke the rules. There is a chance that the issue gets fixed before they die, but at this point it seems so unlikely. We go somewhere to run an errand. Those two have to wear masks when they are on the motorcycles, the poisoner has a mask with eyes visible, the poisoned has to cover their whole face. We go to a building with ramps and receptions inside. We have our scooters with us. We run our errand, but the person is still going to die. After our errand we will go to the place where the one will die. Before we go there, it is revealed that the poisoned actually decide to take the poison them self in order to help the other. It is the ultimate sacrifice. We are trying very hard to get the antidote. We go some place with a large pit, there are lots of white birds flying into it. I don't think we do what we need to in time."
    ],
    "2023-11-09": [
        "Real Time Dalle with Hatice. Hatice and I are in bed, each on our computers. I notice there is a new chatgpt thing. It is dalle that updates in real time as you type anything."
    ],
    "2023-11-08": [
        "Slime planet. I'm am astronaut. We go to a foreign planet, we know there is something weird going on here. When we get there it seems empty of anything like animal life. We end up finding this black slime. The slime can slowly spread. If you touch it, it doesn't matter if you wipe it off, it is like you are infected now, it keeps coming back on you and eventually it kills you. Even knowing this, for some reason I decide to touch it anyways, maybe I think it will motivate me to figure out a cure.",
        "Poker Accusation. I'm travelling, doing deliveries, I just recently had a delivery for a ups package, but I don't work for them. I stop at a casino to play cards. It goes good for awhile. I never really take a huge stack, but my stack just steady grows. Eventually I go to leave and the guy to my left says I took some of his Chips. I insist that I haven't taken any, and I say we should call the floor, and they can check the cameras. Security and the pit boss comes, they mention I'm not from the area, they ask why I'm here. I tell them I do delivery work. They tell me to wait. They ask if I have ever expelled a demon. I say maybe, but if so then long ago when I believed in demons. Most players leave, I wait around and talk. Finally the security comes back, they give 21 of my chips to someone at the other end of the table, and they give me 4 from the guy that accused me. I apologize for the 21 guy, and ask how it happened, they try to explain, but I don't understand."
    ],
    "2023-11-07": [
        "Rooftop Peaople. There are a bunch of people on the roofs of buildings. They can do whatever they want to. Everyone is in paradise, but someone gets hurt in a strangle way, and some people are suspicious, they start planning payback and forming plans. Everything stays fine for awhile. But then be overdubs and humans are also protected. The storyline stays up here, but mstɓh. (I don't know what this ending was supposed to be)",
        "Infralight Event. I'm at some place or event near nicks house. There is a girl there that tells me and nick and someone else that she is going to take us to nicks house around 3pm. That's a few hours away. I hang out in a big gym area. She comes by at some point with a large wheeled infrared light, i stand in it for awhile and then leave. I go to sit with a guy and find out that it is 3:30, I go back and start talking to her. She starts to say something and I laugh, but I'm not sure if I understood her. She seem to pick up on this and she says a few more illegible things as if expecting me to laugh, but I don't because I don't understand. She asks if I have a car, I say im not sure, I left one at nicks awhile ago, but I don't know if it's still there. There is a high cupboard/storage loft, she taps it to scare rats before opening it."
    ],
    "2023-11-06": [
        "Firing Toilet. I'm at a place, nicks old cleaning girl Is working there as a desk job. Somehow I notice there is a sports player that she really likes. I think it was Emmitt Smith. We talk about him for awhile. I tell her who I liked as a kid. She gets official word that says she can't work there anymore. She leaves and comes back and someone uses the toilet and it pretty much backed all the way up, but doesn't spill over. Other people show up and everyone can see this gross full brown toilet. Someone apologizes that it's so full, and I say no, i'm the one who is sorry."
    ],
    "2023-11-05": [
        "Bad guys lie. I am with mom and some other family. There is something that mom wants me to do, but I don't want to. Nydia is also around and I make a deal with mom, she needs to tell nydia something for me, but it is implied that she needs to do it privately. Mom doesn't get this and just starts telling everyone that she is going to do this. I don't remember the specifics, but I am quite annoyed, the whole point was that she was supposed to just casually tell nydia. Separately, dad points out that there are these two creepy foreign, German I think, guys talking about taking a kid. Later on, I happen to come across these guys in a park watching a kid from a distance. I go up to them and tell them that they are so fucked. I lie to them, and tell them that earlier i recorded them talking about taking a kid and now they stalking one in a park. They kind of freak out and run away. They go tell a friend or two and one of their friends comes over to me and we wrestle while he tries to take my phone from me."
    ],
    "2023-11-04": [
        "Restaurant Champion. I go back to visit erie. There is a restaurant that I used to go to a lot and I am on the front of the building as the current trivia champion. I go in with my backpack, but i go into a private room and nobody sees me enter. I talk to someone in there, and mention that it says I am the current trivia champion and that I have a long streak, like a month, but I'm pretty sure I've not been here that whole time. When trivia starts, I try to do it it involves going around the restaurant pushing the right number of buttons. I figure that if I win I'll tell people I'm there, but if not then I'll keep it a secret so that nobody thinks to take down the poster saying that I am the current winner. I do very bad, so I stay in hiding. One of the other private rooms has someone eating in it, but also that's where I store some of my stuff and I want to grab some stuff. When they leave, I sneak in there and I open my backpack and take stuff out to rearrange. It is a very cluttered room, and it is dark. I am concerned that I will forget to put some of my stuff back. It gets very late, 5am, and I think ll the workers went home, I'm concerned that the building will have an alarm and I won't be able to get out. I notice that I can hear a worker still and I see a car pull up to the drive-through, I can tell it's a friend of the worker that is still here, and they are going to get them food. So I think this means that I'll be able to sneak out."
    ],
    "2023-11-03": [
        "Elon University Mascots. We are at a place that is like an Elon university. He had remote control animals there for people to fly. It is messed up, they are not dead, but they have to do whatever the remote control makes them do. Some people are flying them into water on purpose to put them out of their misery. There are 3 buildings on campus, 2 nice normal ones, and then elon has his own that is like a super nice huge garrage. That's where he is in charge."
    ],
    "2023-11-02": [
        "Circus Fly. I'm watching a stage performance. There is a main performer and I think my friend or someone is on it on a normal height unicycle. After my friend leaves stage, a massive unicycle comes out, like 30 feet, almost the the ceiling. It is wheeled out by stage crew. Then snoop dog, or some famous performer runs out and does a leaping mount onto the unicycle. He quickly gets up, does tricks, lays down the uni while staying on it, gets it to go back up, and then starts zooming around like a fly. The main actor is now on their belly on the floor, and they are doing a parallel thing where the main actors is trying to catch a tiny fruit fly, and the man on the unicycle represents the fruitful. They have a tiny version of the stage background. Maybe after the show I'm walking around town on my way somewhere and I walk by a pub or something and the smoke coming out is so gross and painful.",
        "Casual Fly. I'm at a huge open mic at the harborcreek home. I realize that i'm able to fly, sort of. I can kind of lay in the air and do the worm and it keeps me up. I know this is unexpected, but it seems totally plausible and i remember thinking i could bet people in real life and win bets by doing this. So There is a middle aged lady running the open mic. I'm not really paying attention to the performers, but I am drawing, fairly poorly, but I'm super into it and enjoying it, it's something I've not done in a long time. An older guy sees me drawing and says he used to draw and was good. He leaves for awhile and comes back and shows someone a picture he just drew. I barely see it, but from what i see, it's incredible, it is a closeup of a face, and he says he got the detail by using lots of different media's. The person he shows it to says that can't believe it's not a photo. There are supposed to be a foreign soccer team returning to the house from a match. Their match was canceled due to horrible weather and now quite a few players are sick when they arrive."
    ],
    "2023-11-01": [
        "Trip to Israel. Somehow I've gotten onto Israel illegally though Palestine. The World is different. It is as if Israel is the peak of a mountain and Palestine is the base. I feel like I'm in danger and want to go home. I won't be able to go the normal way though, so I think I have to go through Palestine or something like that. I try talking to some people about how to do this. I end up finding some people in the same situation and we figure there is strength in numbers. We find a way where we should be able to go,  but we need to narrate our way out by reading from this paper. I end up as the reader. It is too tough for me and so I decide I will try my luck just walking back to get help for us. The trouble is, it isn't marked when I get to dangerous areas. I get to a tunnel and I start walking through. I see a Palestinian kid at the other end of the tunnel. I get nervous and don't go through. Nearby I see a group of Palestinian and Jews fighting through a fence. I talk to the Jews about crossing Palestine to get home and they say it's not possible. I'm off to the distance talking to some important Israelis while watching in the fence fight. i notice someone has a grenade on the Palestinian side of the fence. I tell the important people and a more intense fight breaks out",
        "Video Games and Pull-ups. I am with savage, a girl I sort of recognize, and maybe Dalton. We have a bit of a club house. We are playing a game like smash bros except the level is super tall and scrolling. I think it's not a great game.r our character are out of view a lot. Later on we have an Asian friend over and he is sending a box. He needs to write his email address on it, and he asks one of us to help. Savage writes the first part, but does it so big without realizing there is more. I try to find a way to write the long part after the @. Savage does some pull ups and when he is done he is annoyed that we didn't all watch him do them. He asks if anyone saw and the girls says she did, and he asks why she didn't tell everyone that he was doing them. We all agree that it isn't a big deal and he is annoyed. Now I'm on stage with a middle-aged important Japanese lady. We are sat at a table. Mainly I'm doing nothing, just sitting while she presents something. Then she says something to me, it is hard to hear and I feel uncomfortable."
    ],
    "2023-10-31": [
        "I go to place to work with or lot of chimpanzees and I have a long checklist of things to identify on this animal, like \"is it a vocal learner\". The list is long and black and white."
    ],
    "2023-10-29": [
        "Life Costing Shoelaces. I'm in the lobby of a theater when I, along with some others are delivered some packaged shoelaces from an australian car insurance company. The packaging says something about \"cost you your life when you slip\", at first I think it means something about the insurance company giving free insurance, and slip has to do with a car slipping, but then I realize that has to do with keeping you from tripping. I remember going in to one of the doors on the back rightist side of the theater."
    ],
    "2023-10-28": [
        "Waterproof Paper. all I remember is something about waterproof paper",
        "Rushed Van Pickup. I purchased a cheap van and I am driving to go pick it up, not really paying attention. There are cops with blue and yellow lights parked in the middle of the 3 lane highway ahead stopping traffic. I slam on the breaks and veer left to an exit ramp avoid them. I manage to stop in time."
    ],
    "2023-10-27": [
        "Bored War. I'm in a war. It is not very involved, it is basically just that we stand somewhere in a group of 2 or 3 of us and we send bullets over near the bad guys that spread out into a bad fire. Sometimes it gets their soldiers, sometimes it doesn't. The other side is doing the same to us. I notice that their fire stuff never seems to get me. I think it's just because wee have good tech, but it also feels like I'm good at war. As we go place to place we are watching videos of other humans doing this and I an thankful.",
        "Homeless Embarrassment. I'm homeless in nyc, walking through parks and such. Finally , I decide I will go for a swim to clean off. I want to put on my bathing suit before I head to the beach, so I go behind a building, I decide I will be super fast, take off my underwear, then try to quickly put on the swim shorts. They are so tight, it is slow  the parking lot is on a huge hill, people see me, I can see them pointing, I am really hoping no. Cop drives by. Finally I get them on."
    ],
    "2023-10-26": [
        "Barely Battery. This was almost nothing, but I remember looking at my phone and seeing that my battery was low which didn't make sense because it had charged all night, so it must have been a dream."
    ],
    "2023-10-25": [
        "Alien Artship. I am an alien. I meet an alien of a different race and we start hanging out. In this world it is not illegal for two different races of alien to hang out, but it is a little strange and it is very illegal to date. We hang out all the time and we text, there is evidence of our relationship in text. Sometimes I go over to her moms house. We need to be careful at her moms house because her mom is, in general, very strict. If we were to get caught, i would be the one to get in trouble. We are going on a walk along a river one day. This river has lots of buildings around it, and lots of amazing graffiti and artwork. We see a piece that looks amazing, the artist is there working on it. I go a ways away to get a good angle of it to take a picture. Before I can take a picture of it, I notice that the artist has put it away. I assumed it would always be available to see, I didn't realize it could be put away. I was 5 layers, the first layer was the statue of liberty holding up one arm, each layer after that was a hand holding up 2 fingers, than 3, than 4, and then 5. When they were all lined up right it just looked like a 5 finger hand. One night we are at her mother's house. Her mom is making dinner. She works at a unique restaurant and invites me over to come see it. She works at a restaurant with an anthropomorphized rabbit theme. She shows me pictures. There are rabbit dolls all over the place, on shelves, and even on the floor. I feel nervous and don't want to be this situation, so I say I would love to go, but I'm so tired. I am concerned about our relationship, and I'm worried that if we break up then shemight show others our texts. I decide that I need to get her phone and delete our texts."
    ],
    "2023-10-24": [
        "RoboChair. chair that has robot legs. fell back asleep to get that since I remember nothing when I woke up first time."
    ],
    "2023-10-23": [
        "War Princess. I am in a war, we have a captive woman, like an asian princess. There are not many people around, just me and another guy. We are in messed up dirty building. He decides he will take advantage. I determine to help her. I semi free her and provide a weapon. She is able to kill him, but now we much need to get out of here and maybe hide his body to buy time. I think we decide to fofnoþn44(umm.. what is this??)"
    ],
    "2023-10-22": [
        "Forgetful meal. Walking around taking pictures with Hatice. There is an Alice in wonderland monument background. There is a place she poses with a large lit up Christmas tree. A guy is at a restaurant with his gf. For some reason he goes to the front counter while they are still eating. He decides to pay since he is up there, but he forgets which meals they ordered, so he goes back to ask there is a chocolate and cream dish that she is saying he ordered, and so he should know, he felt like she had basically made him order it because she didn't want to admit it was what she wanted. She is a little annoyed because  Then he goes again to pay.  The next day I am at the guy and gf's house and he tells me this story: after he went home from the restaurant yesterday, he had a confrontation with a bad guy. It turns out that he owned a gun and it somehow got him out of the situation. Maybe he shot the bad guy or maybe just shot near him.. He has about 12 friends over and goes to the backyard with them. I am talking to the gf and I mention how lucky they are that he had a gun, but she is clueless about this happening. After awhile I forget he has friends over. I go out back and they are playing a volleyball variation with no net and free movement. I join even though I don't really know the teams or how to play. The song Baby Got Back Is playing."
    ],
    "2023-10-21": [
        "AI Future Forest. In future ai takesover for specific communication and humans develop communication that all other humans instantly understand because it is strictly tonal. Ai begins picking Mates for people. It becomes illegal to do communication that ai can't have easy access to, no handwriting or going places outside of ai's hearing reach. It could turn out that animals with the simplest communication that all other animals understand are actually the animals that had the best foresight of the coming ai communication assistant."
    ],
    "2023-10-20": [
        "Wanka Cosplay. Savage and i go to see a small theater performance of willy wanka. They want the audience to dress up as characters and they ask savage to be willy. He gets bored part way through and doesn't want to wear his hat. The show doesn't make much money.",
        "Japanese Metro Spaz. I am with a group of Japanese guys and we are ridding the subway. I think we all have tickets, but when we try to leave the metro worker stops us. The don't seem to even be trying our cards, just saying they are not working. The worker is super spazzy and jamming buttons. I tell a cop I think they are having a seizure.",
        "Og Street Performer. I see Lidya, she is performing at a metro, doing amazing plate spinning. Later on we talk a little bit. I ask her where the best place she has found to street perform is. She says Og because it is near where several pilgrimages begin, so lots of people come through there when just beginning their hikes and they have their own money. Someone comments that they think street performers can't make much money, but i tell them that they would be surprised."
    ],
    "2023-10-19": [
        "Super Good Colombian Monster. I'm at some sort of club, meeting thing. We are discussing something and then we get on the topic of an upcoming event. The leader wants to know who can attend. The first person says they have to ask their wife, a few people say they will probably come I think, then another person says they have to ask their wife. When it gets to me, I say I have to ask my wife, but then I immediately feel bad because I lied, I have no wife. I consider correcting myself but don't. After me this fat little kid says something about how his mom dropped him off from Colombia when he was very young. It is awkward and sad. I ask him if he ever wants to go, he says \"yes, every second of every day\". He is very sad about this and starts eating like crazy. I try telling him that he can channel this sadness into being a super good monster."
    ],
    "2023-10-18": [
        "Pay nick. I go to visit nick and he has weed suckers for me. He also has a bill for them for me to pay for. Mom has a bill as well for something else, and the bills are together.",
        "Erie boats. I take hatice to the Erie house. It has changed a lot. Something like a home owners association has put together a free floating dock station there. At first she doesn't want to leave the house, but then I convince her to go out because we can see pretty much h the whole family out there enjoying it. We walk around on a floating dock, a small boat comes near us and someone throws me someone's purse while they get off on a boat and onto a dock. I jokingly go to walk away with it. We see mom and we talk briefly about how it used to just be a small like wood workshop down here on the lake, now it is so developed."
    ],
    "2023-10-17": [
        "Flying Wealth and Poverty Mountain. I am at a place where the higher you go, the less well off is the country you are in. Iraq was very high. Generally when people go high, they risk jumping off because they don't actually fall as fast as it seems like they would, and of they succeed then they can stay in the country they jumped down to. Mom and the grand kids and Bethany are visiting me in this strange world. I've gotten used to jumping down a few countries so I show mom and them around. It is a rush jumping because we can sort of jump like we want and float down.",
        "Pokemon Puzzle. I am with nick and I am on need of a shirt. My shirts are on a public building where we were staying together, along with his wife or gf. I go to get a shirt from the suitcase and I notice that all my clothes are gone, as well as my black shoulder bag with my cash and IDs. I discover my stuff nearby at the place where there is usually a homeless man. It seems odd that my stuff is there, I think maybe it was nicks gf that wanted my stuff away from hers. My orange t-shirt is here, but it is long sleeve in this dream.. I gather my stuff and go back to nick. He is playing a new version of Pokémon. I join. The characters in this Pokémon are female. It is different than other Pokémon. It is a mix between street fighter and super Mario bros, it's like super smash bros. and while doing hand to hand combat, there are Pokémon fighting in in the peripheral. I tell nick while we are playing about what happened to my stuff and ask if it was his gf wanting my stuff away from theirs. He doubts it. She comes by eventually and she is surprised."
    ],
    "2023-10-16": [
        "Unexpected Snow Tour. Hatice and I sign up to do a tour. A van picks us up and starts driving us. At first we are awake. We are sitting on either side of the aisle. Eventually I fall asleep and when I wake up, there is lots of snow on the ground and it is snowing hard. Hatice is asleep. We were not at all expecting snow and we are not prepared. I notice another woman on the bus has boots, so other people did know what to expect. I consider waking Hatice so she can think about what we can do about this and can see the snow, but I let her sleep. We drive out of the snow eventually, but I can see snow in the distance below us, there are hills around and the snow is only at the bottoms of the hills. A middle aged man moves to sit next to Hatice and she wakes up and switches seats and falls asleep again. We stop in a parking lot and I am able to just stand on the ice and slide down the hill."
    ],
    "2023-10-15": [
        "Uphill adventure. There are a few of us on our way somewhere. We need to go uphill through a city. I think nick has a stroller with kids in it. Someone else has a bicycle. I am in front and I have nothing. I am walking on the sidewalk but it gets so steep that I have to go into the grass and dig my fingers into the dirt to be able to continue up the hill. I am alone at this point, I've no idea how the other 2 will make it up  eventually it gets too steep even to climb on grass and dirt so I make my way over to the now vertical sidewalk and I pull roots out of the sidewalk cracks and I begin climbing them like hanging vines. I am worried that they may break so I am trying to double them.",
        "Cookie bones. Mom is there and acting strange. Savage is there. She says she went to a doctor and learned there is something rare about her bones and after she was told this, Oreo showed up and offered her lots of money when she died for her bones. Caleb shows up and I repeat the stuff mom said and this makes her uncomfortable and she leaves.",
        "Dariush convention. I'm at something like a rainbow juggling convention. It is nice there, one day people are yelling and a bunch of people come through riding buffalo's and even tractors using rope to steer in a way that they can't see what's in front if them. They are going so fast and dangerous. I try to avoid them some but run down the hill. At some time I have some chocolate and I offer it to Dariush and he rejects. I asked why some and we talked and he ended up having a little bit. I ask why it's unhealthy. He said but I guess it was just chemicals he didn't remember when we played poker on his birthday."
    ],
    "2023-10-14": [
        "Star Surprise. There is a big event, I feel like the guest of honor. I have plans of a place to stay. But lots of people want me to stay around them. I get an offer to stay st a house that is part of a group of expensive boat houses. I get surprised with a huge fee.",
        "Schoolkids Last Day. I'm working at a school program with kids. I am some sort of assistant. One of the main teacher women are leaving. It is really sad, she will leave all her kids. She cries and so do i for her. for some reason it becomes OK for kids to go home early and for me too.  I help a kid, seems like my nephew or something get a metro ticket so they can go hoke early as well. To get to and from the place to buy metro tickets there is a sketchy ladder to a platform we must do. He does it very naturally. I'm about to leave, but then decide to stay at the school and read some of my book. At some point I Show dad and nick a special part of vscode that executes code immediately and tell him that it is also for coding in vr,  but ive bo idea how its related."
    ],
    "2023-10-13": [
        "Apartment Experience. I answer an ad to go look at an apartment. It is in a basement. It will be shared,  but I get my own room and a shared rec room. When I go to check it out, the other guy living there is not home. I have a place with family nearby but I need space sometimes. I agree to rent it. I come back later and my flatmate is there. He seems kind of nice, but he isn't thrilled about sharing it. He is the son of the people renting it. He pays rent. He tells me I can use the house sometimes, but not always. Later on we are at college, first day I think. A girl comes up and the three of us are talking. Turns out they both like the same kind movies  and they both like to bowl blindfolded. I try to get them to both go do something, but she refuses. Me and the guy realize that someone is watching something at his house today and we have a projector and a huge speaker and we can hook then up. We go home to do that. We get distracted by trying to flip coins high up onto a bookshelf.",
        "Snack To Convention. Hatice and I are on our way to a juggling convention, but we need to get food first. We have no car and so for some reason we ask someone with a car who is going to take our phones. We manage to make it to a store, they have Doritos and a chicken restaurant. We buy Doritos and ask if the restaurant has vegan food. They say no. A customer tells us that when they came long ago they were stuck eating Doritos as well."
    ],
    "2023-10-12": [
        "Little Anger. I am going for a boat ride or something, I'm not sure what, but people are lined up to go into a building. There is a very short Israeli guy that is not happy about me going. He follows me around outside the building for me to break a rule or something I guess. He doesn't carry why I cant go, just really hopes that I cant go. For some reason I woke up with my watch in My hand. He has weapons but nothing is good enough to actually leave."
    ],
    "2023-10-11": [
        "Puzzling Washer. I'm out travelling, someone else is in my group, but its not hatice and its not savage. Savage is travelling in the same place as me though, we are staying in the same apartment building hotel. I figure out how to pretty much use the communal washing machine, but my clothes are still slightly damp. I notice savage is using the room service to have his clothes cleaned. I ask him why, and he says nobody could figure out the washer. I tell him I can do it, but it has a problem While I'm showing him. I notice hatice is gone and I get sad and wake up.",
        "Hometown Hacky Scam. In a small town that is like a combination of northeast and harborcreek. Some people that remind me of childhood are there, but only one real person, Becky. I walk around a lot, usually alone. I buy 6 hack sacks full of weed seeds for a pretty high price. Later on i see Becky, we've not talked in a very long time, I saw hello. And make sure she is Becky by asking her. She indicates to her Long goatee and says he name is Greg now. I walk around more, eventually I stop buy the store that greg works in, and look at a paper on the desk and I leave. Later I go see some friends, they are messing around, someone is trying to break a window. A kid falls off a table. I run into someone who has my beanbags. They were expensive. We are talking about how much I can sell them for. One is open, it is full of shiny rocks, not seeds. Something stinks. We open more, each has a different worthless thing in it, I got ripped off."
    ],
    "2023-10-10": [
        "Face Mold. I am working on some sort of project, and am having an issue. I am with a flamboyant friend and they suggest that a solution would be to have a mold taken of my face. We go to a place and they are about to close, but they agree to quickly do it. They fill a large barrel full of a black liquid. I am concerned that it is latex and will make my psoriasis bad. I'm debating in my head and I say I don't know if I want to do it. Since it is set up, my friend decides to do it. He puts his face in, some of his long brown hair goes in as well he takes his face out and the black stuff instantly hardens and they peel it off. I make a comment about how well it came off of his face."
    ],
    "2023-10-09": [
        "Interactive Zoo. I am at something like a dangerous interactive zoo. I mention something dismissive of their fiercest snake. So, they set the snake after me. I get chased around by it. It seems to be in as good chase,  it it is scary and dangerous. (Animal species survivor would be a good vr game, maybe even one where you are a predator animal)"
    ],
    "2023-10-08": [
        "Misunderstood Entertainment. I'm watching an old black and white movie with savage. A few times we pause to look something up about the movie. We have a few realizations a few times about how things are happening that are strange because they are mirrors of Christians misunderstandings of the original Christian teachings where some things get over represented. For instance, there are grapes everywhere and it shows how important their grape juice is to them, but they ignore the parts about being stewards of the land. There is other stuff about being superstitious, like people cant get out of their house for some reason."
    ],
    "2023-10-07": [
        "Jumbled Delicacies. I have hatice or someone like her over to grammas house. The dream is pretty chopped up into fragments. There are some vending machines that are hooked up to a system of room rentals and i get blocked from the vending machine for having sex in a room rental. This happens to a guy working at a store as well. I have a family reunion and Doug Wilson is there. He is squeezing oranges onto a table and locking it off with a dog."
    ],
    "2023-10-06": [
        "Family Business. There is a big extended family. All kinda living together near the harborcreek. There were sort of ruled by a mother. She had a main son and a father that were kind of 2nd in commands. Her son had lots of kids. I went looking one day kind of frantic and saying I need to find her father. I thought something went wrong, so I needed to know he was a fine. The main woman told me where to find him. She also mentioned money was low and asked if I could help out. I say I'll think about it. I end up deciding i will give 40 euros layer. I find the son he has lots of children. I hang with the kids little bit. I tell him i'm going on a long trip. He wonders if I could teach at their homeschooling at some point. I say probably. He asks if I want to buy some weed they grew. I agree. He puts the weed in a huge bag with some sand dirt. He friend tells him that a bad idea because it makes the week worse. I find the mom and give her the 40 euro, and ask how i can order food. She gives me a delivery sheet and says another woman wants cheese fries, but I don't want to order non vegan, so I just don't order. I finally go to leave the group and I see the son, he is outside organizing the group into color by the shirt they wear. He is tired of life I think.",
        "Weed Pros. I go to a place where there are some guys my age that grow weed. They're friends of a friend or something. I ask when the difference between indica and saliva are. The most knowledgeable says that the female makes a sort of list for the male and than the male brings the attributes that the female wants. That list made by the female is what determines what kind of weed it is. We start talking about chatgpt. I ask if anyone has seen gpt vision, they haven't, so I give some examples of it. Then I tell them about gpt voice and finally the internet access. I think go on to explain phind to them and how to use gpt4 for free."
    ],
    "2023-10-05": [
        "Uncomfortable Massage. Hatice and I go to a massage place. They tell us the room to go get undressed, separately, then where to go to get the massage. Hatice finishes before me and goes to meet the masseuses. I think she couldn't decide between the two girls so they are doing it randomly with their names on cards. I walk in, and awkwardly, sat nothing when I arrive. The host and both masseuses are there, and and someone mentions my silence. After it is selected who gets who. We are supposed to go put our valuables in a locker. The locker doesn't lock and I am surprised/annoyed. This annoys the host. I feel bad. But I can't relax with my valuables just sitting out. I bring them with us. Now, it cuts to hatice and I being about to watch a show. Before the show, there is a funny guy making jokes, talking about chimpanzees. The show starts, It is performed by hotel staff or something it seems. Hatice comments that everyone in this country have incredible skills. It is acrobatics, starts out normalish, at some point someone is spinning soup ladles, but then it starts incorporating a couple very amputated people, people that are practically only heads and a couple limbs.",
        "Nicks Other Mom. I go to visit nick(sometimes he's daulton), he is a teacher. I meet his students. He had a separate mom from me and he has recently killed her. It seemed very justified. I go to his school. Tell his students about circus school. We go to get sushi, but i dont eat fish."
    ],
    "2023-10-04": [
        "Dolphin Marathon. I am somewhere in Africa, there is a marathon race and I sign up and start running. I am going good at first, but I want to listen to something other than music and my phone battery is dying. While I'm running, I manage to get a hold of someone to get me something else to listen to. I switch devices out on a counter in a the race. Sometimes I have to run with no audio. The race is going good, more than half way through. I get and make the choice to put dolphins in the route ahead. I do, but some get killed by sharks as babies. Some dolphins get bigger, but I see sharks trying to eat them, so I try to beat up the sharks using the dolphin as clubs sort of underwater. I feel bad. It kind of works, sometimes dolphins get bit.",
        "Bad Good Father. I am staying with a family, they have a father and two young daughters, there is another adult male around, not sure how they are related. I get some methamphetamine somehow, i don't know how, but i do know that in that context it is pretty unusual for me to get it. i do a line of it, but I don't remember feeling different from it really. I am talking to the dad and I mention that I have some cocaine, he is surprised, but interested, and asks if I am serious and i say no, but I really do have some methamphetamine. He wants to do it, and so we go put a line on a little table. He does it in front of the daughters, and so does the other guy."
    ],
    "2023-10-03": [
        "Fancy Farm Dinner. A restaurant gives a trip to a farm and they give a shot of strong liquor while waiting for your food.",
        "Cliff House Whale Tale. I'm staying at an apartment and to get to it, you need to climb this ladder. The ladder itself moves, and you can move it while climbing. The ladder goes down to a shore I think. They have used this exact ladder in several different movies. Savage comes over one day to see my new place. We are in the car going to my new place, and talking, and I am explaining about the ladder. The conversation shifts to the new whale birthing. I tell him that for the first time, people have witnessed a sperm whale being born. I tell him that the sperm whale needs air and so all the other sperm whales hold it up out of the water. Dolphins show up to witness the event. Pilot whales show up as well. Pilot whales sometimes attack sperm whales. The pilots charge, over and over, but never actually go all the way to attacking the sperm whales."
    ],
    "2023-10-02": [
        "Love Dungeon. I am in a strange hospital/hotel/prison/entertainment kind of place(but we seem to be free to leave). Older men and women are doing some sort of Sexual experiment on a younger woman, it seems like maybe it is for my entertainment. In general, the place has a very erotic vibe. Hatice shows up and they put us on adjacent hospital beds, we are pretty out in the open, it is a large room with lots of beds like ours, but most are empty. We have curtains on tracks around us that we can pull shut if we want to. We are laying there on our own beds talking about religion. I bring up the point that I can't believe that God would make all my family, aunts, uncles, cousins, parents, everybody be born into the wrong religion. And I ask her what percent of people does she think endup in a religion that they were not born into."
    ],
    "2023-10-01": [
        "Magic Exception. I go to a magic shop with a friend and as we get there, people are leaving. We try to go in and the owner, guy from hangover, tall, the owner, says he is closing. We beg to go in for a few minutes to get something fast. I saw I just want a set of a couple cards and I tell him I know how to do the muscle pass with cards. This impresses him and he let's us in. I say I use to have a special small set and he gets a small set with invisible string. My friend has not seen invisible string before. I explain that it is hard to work with. For some reason I consider if mom will be able to use it or not.",
        "Hotel Intruders. This last dream ends and I'm in a hotel room with Hatice. We are getting ready or something and someone comes in. A woman, she has a towel. We talk for a sec and she leaves. It was weird. Before we can lock the door, she walks in again, says nothing, and walks across the room and gets her forgotten towel and leaves. I motion to Hatice to lock the door and before she can, another woman walks in and asks why the first woman keeps walking in.",
        "Ankitown. A city that is sort of set up as an interactive Anki school somehow. It sort of feels free, but sort of like a school. I remember being impressed by the place, however also stressed out when some public anki machine wouldn't work, or when I couldn't figure out how to use it or something.",
        "Billie Concert Friends. I am working some place with little furry cute monkeys. I take 2 babies and an adult away with me and go to a Billie Eilish concert in Miami and take selfies with them there. I try to get Billie Eilish or her name in the background of the selfies, but it is hard, not sure if I do it. It is hard to handle all 3 monkeys there. For the most part they ride on me, but sometimes they get down. Billie comes out and announces that snoop dog is in the audience. I leave early because the monkeys are hard to deal with. As we are leaving, a baby monkey gets caught in some hanging chain links at the exit, it sort of hooks through her nose. I release her. We finally get back to the monkey place, we ride a truck there, I think I sort of hitchhiked. There is a fire as we get close and they are putting it out by using a crane to drop burning stuff into the water. It seems fake to me because the fire goes out before it touches the water. The truck I rode Is collapsable and I watch them collapse it automatically. I can't find my phone so I frantically mime to them that my phone is i the collapsing truck. Then I find It in my pocket."
    ],
    "2023-09-30": [
        "Nick's livingroom battle. I'm at nick's place, but its unfamiliar, ian comes over. I am happy, I want them to meet. Nick is out, but savage and a couple others are there. Ian puts a USB into nicks private laptop. I ask why, I'm suspicious. He won't say, i take it, and we start yelling. Turns out he was hacking, maybe just for fun, but still. I make him leave. I tell others whey he is angry and leaving. Nicks kids custody paper has a signiture from his ex, but it gets ruined, and now the paper needs to be refulled out and signed. I sign her name, it isnt like her signiture, but we erase it and nick plans to do it. Bad guys show up, but I don't remember why. Im shot in the head, bleeding, I manage to grab one of the bad ladies and smash her head until it is gone and until she is dead. She can't hurt me now. A big big guy is after me though, and he isn't shot."
    ],
    "2023-09-29": [
        "Itchy Spider Bus. I'm on a bus with hatice, and her girl friend and that friends friend. We are going somewhere and at some point the friends start itching and they say that they have a very contagious itching spider that goes from person to person.",
        "Embarrassed Foreigner. I'm with hatice and a guy friend that she has from school. They are working on a project. I am making some, sometimes silly, suggestions to hagice it turkish. Then I realize that they are also speaking turkish together, so the friend also has possible understood me all along.",
        "Vehicular Clown Purchases. I'm in japan, I make a friend that has got a huge flat-front truck and they will live in it while driving around with weed in it. I start thinking about doing that myself. I tell them and they offer to sell it for 25m jpy / 4k usd. Later I befriend some local clowns. One of them gets a lawnmower and is mowing lawns to make extra cash. One day I decide that may be a good way to make money and shortly after that I see them.when I finally go to talk to them, I run into the older woman clown that started the clown character that they both play. We discuss the possibility of me buying the clown persona and the lawnmower."
    ],
    "2023-09-26": [
        "Distracted Stabber. Nick and I go to the house of 2 brothers in the country, one is disheveled, big lumbering, long hair, dirty. We miss our last bus back home, kind of just by deciding to stay longer because we are uncomfortable about leaving, they seem lonely and maybe dangerous. At some point there is joking about the big one stabbing us. I think maybe we can call for a ride from someone online and then I'd I perform and prolonged drawn out couple of tricks then maybe we can survive and the quickly leave. They have some toys bit they are too floppy for me to actually balance on my face so I keep trying and failing. The car doesn't respond. I hide 2 knives under some magazines but the big guy eventually finds them. Finally a chase starts, his eyes look crazy as she chases me. He seems childlike sweet. I wake up while he is chasing me with the knife.",
        "Busan Chang's. In Busan, sk. Not sure where I want to go, so I decide to go to Pfchang because I want to always have the memory and story of having had gone to one that was actually in Asia so whenever I go to one in the future. Someone is with me, I think it's nick, I am navigator using my phone, we take a metro, I am navigator. We get a stop or two away and I can't breath through my nose so I start looking through my bag for a tissue. When I look up there is someone pointing a gun at me, they are a cop or security, they smile when they see its just a tissue. I have a hard time blowing my nose. Finally we get to our stop, it is an area of town with tons of dungeons and dragons figurines."
    ],
    "2023-09-25": [
        "Busted Power Cord. I had a power cord and it had a broken prong.",
        "Pantless Belt. I had a belt and needed pants so i went to thrift shop. I showed the shop worker my belt and told them it was mine. I asked if they had more and they told me where. I also asked about pants and they told me where they were.",
        "Ejected Gym Student. I was in some sort of gym class and have to leave part way through temporarily and the teacher came and asked for my shorts for someone else to use so they could join the class. I was annoyed, but gave them and then left the class.",
        "Future Retro Gaming. I'm at a gaming place with mom and and brother, the world is mainly is like a videogame, like vr, but I remember no headset. We get lockers for stuff, mine is on a different floor. The game itself is a low graphics running jumping shooting game. Running is shown by big circular legs blurs without any real movement. Mom and brother get stuff from their locker but I need to get back to mine and remember my locker code. They have a small box of coin rolls. Each level is basically the same, just harder and different animation pics."
    ],
    "2023-09-24": [
        "Specialized Food Court. I'm at an Asian restaurant with a cafeteria food court, it is unusual because the different restaurants each make their own part of the meal, such as a meat one, a sauce one, a sides one.",
        "Weird Meat Travellers. Rode the bus with two friends trying to find our hotel. In the bus showing some strangers some magic tricks, but i didn't know many. They were only somewhat impressed. The muscle pass didn't really work well since I'm out of practice and my callous is gone. We were not sure which stop to use, but we got off eventually. While walking through a mall with a stranger who was helping us find our hotel I saw a sick or wounded dog on a blanket and I thought it was a veterinarian in the mall. Then I noticed large raw meat near the dog and realized they were killing dogs for food."
    ],
    "2023-09-23": [
        "Rejected Escalator. one day I go to use an escalator to some high touristy thing and the lady doesn't let me, I don't remember why, but she let's people use it even if they have luggage because she has lockers for their stuff. the next day I can't use it because I am not allowed to use lockers for my stuff."
    ],
    "2023-09-22": [
        "Crossing to Meaty Coffee. I'm in a field there is a Hindu guy working on a path across the muddy stream to leave the field. The first time I want to go he is very helpful, stops what he is doing, and clears a way for me. The next time when I want to leave with nick he is less helpful. We talk for a long time and he says i cant go across his bridge this time. Nick is already on his bridge, so he walks across. I try to go across the same way but the bridge bends and my foot gets very muddy. I end up running and jumping across. Nick and I go to Starbucks and there is meat everywhere. We decide to go somewhere else. We go to a place where nick buys a large box of coffee that comes with a bag of raw meat and a bag of raw dough in the box. One worker is surprised that the other one uses a bag of raw dough. I go to another place, alone, to get a large hot black coffee for someone and an ice latte or something for myself. The worker barely fill mine, and they can't figure out how to get hot coffee without burning themself because the coffee dispenser needs pushed up at the nozzle. I suggest using chopsticks and it works. They try to charge me 9$ for both coffees even though mine is almost empty, I complain and they say I have to do trivia or some contest to get mine full. I do whatever I needed to, and end up getting both coffees."
    ],
    "2023-09-21": [
        "Don't Write So Much. a girl telling a guy who is on his computer to not write so much",
        "Soccer Camp. juggling soccer resort camp, with dorms, i got switched to a dorm with 3 bunk beds i thought, but maybe i was confused and actually was just sent that information to be able to go there to buy something. i hitched a ride out once to a little shop to explore a little and look for a cold coffee drink, but didnt find one",
        "Resort Squared. A square resort island we kind of get to see some sunset. There are trays of food set up outside in public areas if you stay at the good resort."
    ],
    "2023-09-20": [
        "Insulted Juggler. uri insulted someone at a juggling festival, he punches guy in head it makes a crater. cop come and treat him horribly. beat him and make him carry heavy stuff.",
        "Juggling Reunion. i run into mike from highschool at an ejc and i tell him i hang out with some of the best jugglers. He is fairly new to juggling and there with a friend."
    ],
    "2023-09-19": [
        "Garage Campers. 9 of us live in our vehicles on a garage together, i struggle to put my van in the right place. Some vans are missing",
        "Busted Zipper. One zipper pull thing comes off of jacket, manual shows instructions to put it back on on page 607 with a warbler and I ask neighbor bc he has the tool."
    ],
    "2023-09-18": [
        "Druggy Dreamer. im with some people, we do some sort of drug or something and i black out and have a dream and we do some sort of crazy something and later on i tell them about the dream i was having while we were doing whatever we did.",
        "Bad Students. im with some sort of school group, and we have a reutation for being bad. one day an army of soldiers come to have a sort of intervention for us. there is a presentation happening and a lady worker/teacher comes to survey me about my badness and asks questions like do i do drugs at least 1/3 of the days. a student comes over and asks if there is someone or something i want to hold, and i say yes."
    ],
    "2023-09-17": [
        "Andy's Scam. in a store with andy and someone else, trying to do something with socks. andy goes up some stwp/ladder to get sock and intentionally slips and slices his hand in front of manager to sue the store.",
        "Savage's Box. met sav in nyc, hatch plan to go to ac. decide to maybe get a prepaid box to send stuff on to nyc once he rqils. show him the sleepinfg path on nexr island",
        "Liquid Courage. liquid courage and people with large physical brains"
    ],
    "2023-09-15": [
        "Raging Roommate Ramsey. I was with gordon ramsey, i was dating someone living in his apartment, he wasnt especially nice. I was walking out of his apartment one day without a shirt on when he was walking in his his son, they both were shirtless as well.",
        "Water Rappers. I was part of a rapping crew. There were 2 rappers that didn't know each other. The guy I was with was more cool and collected, but intense. He was white, kinda built and tall. The other guy was so nervous, he kept saying he over focused. We met at the studio. Someone had soda water from a machine. We were waiting at bar seating in the middle of the room. Waiting for a big time producer. I imagined myself freestyle rapping."
    ],
    "2023-09-14": [
        "Patient Kim. Kim Kardashian with doctor behind her",
        "Smoking Group. Group smoking on city street, one hitter and a bowl",
        "Maid 'n Man. Maid cleaning room with man in bed",
        "Action Photo Boat. riding around in a boat taking action shots of crazy waves out window, this is after taking pics of islands and such outside the windows."
    ],
    "2023-09-13": [
        "None."
    ],
    "2023-09-12": [
        "Weed Dream Chaser. I knew I was dreaming and thinking that since he really wanted the dream, if I could keep him chasing the weed then I could stay in the dream",
        "Deaf Jealousy. I'm living in a snowy place and there is a deaf girl there. She is jealous of something, and she rigs up my headphones to make me go deaf. She gets caught, my ear bleeds, i can still hear out the right eye a little. Ir. Good thing is, now I can buy expensive subtitle glasses that can translate any language. No idea how to give data in new language in conversation."
    ],
    "2023-09-11": [
        "None."
    ],
    "2023-09-10": [
        "None."
    ],
    "2023-09-09": [
        "None."
    ],
    "2023-09-08": [
        "None."
    ],
    "2023-09-07": [
        "None."
    ]
}